Air Brake - Flap Cases/SteadyCase-BaseCode/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
		// type			fixedFluxPressure;
        value           $internalField;
    }

    ground
    {
        type            zeroGradient;
    }
	
    building
    {
        type            zeroGradient;
    }

    flap
    {
        type            zeroGradient;
    }

    flap_upper_top
    {
        type            zeroGradient;
    }

    flap_lower_top
    {
        type            zeroGradient;
    }

    flap_upper_front
    {
        type            zeroGradient;
    }

    flap_lower_front
    {
        type            zeroGradient;
    }


    spoiler_upper_top
    {
        type            zeroGradient;
    }

    spoiler_upper_front
    {
        type            zeroGradient;
    }

    spoiler_lower_top
    {
        type            zeroGradient;
    }

    spoiler_lower_front
    {
        type            zeroGradient;
    }


    #include "include/frontBackUpperPatches"
}


// ************************************************************************* //
