Air Brake - Flap Cases/SteadyCase-BaseCode/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v10 or later                          |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     	simpleFoam;
startFrom       	startTime;
// startFrom       latestTime;

startTime       	0;
stopAt          	endTime;
endTime         	5000;
	
deltaT          	1;
	
writeControl    	timeStep;
writeInterval   	5000;
	
purgeWrite      	0;
	
writeFormat     	ascii;
writePrecision  	6;
writeCompression 	off;
writeResiduals		on;

timeFormat      	general;
timePrecision   	6;

runTimeModifiable 	true;

functions
{
	velProfiles
	{
		#include "sample"
	}
	
	turbVelProbe
	{
		type					probes;
		libs            		("libsampling.so");
        writeControl    		timeStep;
        fields          		( U );

        probeLocations
        (
            (0.790 2.318 -0.5)
        );
	}
	
	metVelProbe
	{
		type					probes;
		libs            		("libsampling.so");
        writeControl    		timeStep;
        fields          		( U );

        probeLocations
        (
            (-27.432 2.318 -0.5) // Quick estimate that met tower is ~90 ft in front of container
        );
	}
	
	contVelProbe
	{
		type					probes;
		libs            		("libsampling.so");
        writeControl    		timeStep;
        fields          		( U );

        probeLocations
        (
            (-4.6009 2.318 -0.5)
        );
	}

    solverInfo
    {
        type        			solverInfo;
        libs        			("libutilityFunctionObjects.so");
        writeControl   			timeStep;
        writeInterval  			1;
		
		fields
        (
            U
            p
            k
            omega
        );
    }
	
	yPlus1
	{
		type            		yPlus;
		libs	 				("libfieldFunctionObjects.so");
				
		enabled					true;
		writeControl    		writeTime;
		writeInterval			1;
	}
	
	wallShearStress1
	{
    // Mandatory entries (unmodifiable)
    type            wallShearStress;
    libs            (fieldFunctionObjects);

    // Optional (inherited) entries
    writePrecision  6;
    writeToFile     true;
    useUserTime     true;
    region          region0;
    enabled         true;
    log             true;
    writeControl    writeTime;
    writeInterval   1; }


}

// ************************************************************************* //
