Air Brake - Flap Cases/SteadyCase-BaseCode/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
	object			sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            sets;
libs            ("libsampling.so");
writeControl    writeTime;
interpolationScheme cellPoint;
setFormat       raw;

fields          ( U );
sets
(
    turbVel
    {
        type            uniform;
        axis            y;
        start           (0.790 0.61782973 -0.5);
        end             (0.790 4.01782973 -0.5);
		nPoints			100;
    }
	
	turbHeightVel
    {
        type            uniform;
        axis            x;
        start           (-38.86199951171875 2.318 -0.5);
        end             (20 2.318 -0.5);
		nPoints			600;
    }
	
);

// ************************************************************************* //
