Air Brake - Flap Cases/SteadyCase-BaseCode/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;  // Enable castellated mesh generation
snap true;             // Enable snapping to STL surface
addLayers true;        // Enable inflation

// Geometry definition
geometry
{
    building
    {
        type triSurfaceMesh;
		file "Building.stl";
    }

    flap
    {
        type triSurfaceMesh;
		file "Flap.stl";
    }
 
    flap_upper_top
    {
        type triSurfaceMesh;
		file "Flap-Upper-Top.stl";
    }

    flap_lower_top
    {
        type triSurfaceMesh;
		file "Flap-Lower-Top.stl";
    }

    flap_upper_front
    {
        type triSurfaceMesh;
		file "Flap-Upper-Front.stl";
    }

    flap_lower_front
    {
        type triSurfaceMesh;
		file "Flap-Lower-Front.stl";
    }


    spoiler_upper_top
    {
        type triSurfaceMesh;
		file "Spoiler-Upper-Top.stl";
    }

    spoiler_upper_front
    {
        type triSurfaceMesh;
		file "Spoiler-Upper-Front.stl";
    }

    spoiler_lower_top
    {
        type triSurfaceMesh;
		file "Spoiler-Lower-Top.stl";
    }

    spoiler_lower_front
    {
        type triSurfaceMesh;
		file "Spoiler-Lower-Front.stl";
    }


	refinementBoxOuter
	{
		type box;
		// x-dimension is to start at incident recirculation zone
		// y-dimension is to start at ground
		min (-30 -15.24 0);
		// x-dimension is to cover cavity region
		// y-dimension is to cover rotor and an additional 1.5 m above
		max (100 7 .5);
	}
	
	refinementBoxInner
	{
		type box;
		// x-dimension is to start at incident recirculation zone
		// y-dimension is to start at ground
		min (-5 -5 0);
		// x-dimension is to cover cavity region
		// y-dimension is to cover rotor and an additional 1.5 m above
		max (7.5 5.5 .5);
	}

	
	refinementBoxSpoiler
	 {
	 	type searchableBox;
	 	min (-0.5 -1.6 0);
	 	max (2.5 0.8 .5);
	 }

	refinementBoxFlap
	 {
	 	type searchableBox;
	 	min (-0.125 .02 0);
	 	max (.035 0.185 .5);
	 }


}

// Castellated mesh controls
castellatedMeshControls
{
	locationInMesh (-20 0 0.25);
    maxLocalCells 100000;    // Limit the number of cells per processor
    maxGlobalCells 5000000;  // Limit the total number of cells
    minRefinementCells 10;   // Minimum number of cells to refine
    nCellsBetweenLevels 2;   // Smooth refinement between levels
	allowFreeStandingZoneFaces true;
    features
    (
	  {
            file "Flap.eMesh";
            level 2;
      	  }

	  {
            file "Building.eMesh";
            level 2;
      	  }
	  {
            file "Flap-Upper-Top.eMesh";
            level 2;
      	  }
	  {
            file "Flap-Lower-Top.eMesh";
            level 2;
      	  }
	  {
            file "Flap-Upper-Front.eMesh";
            level 2;
      	  }
	  {
            file "Flap-Lower-Front.eMesh";
            level 2;
      	  }
	  {
            file "Spoiler-Upper-Top.eMesh";
            level 2;
      	  }
	  {
            file "Spoiler-Lower-Top.eMesh";
            level 2;
      	  }
	  {
            file "Spoiler-Upper-Front.eMesh";
            level 2;
      	  }
	  {
            file "Spoiler-Lower-Front.eMesh";
            level 2;
      	  }

        );

    // Surface refinement
 
    refinementSurfaces
    {

    building
    {
        level (3 3);  // Minimum and maximum refinement levels
    }


    flap
    {
        level (5 5);  // Minimum and maximum refinement levels
    }
 
    flap_upper_top
    {
	level (5 5);  // Minimum and maximum refinement levels
    }

    flap_lower_top
    {
	level (5 5);  // Minimum and maximum refinement levels    
    }

    flap_upper_front
    {
	level (5 5);  // Minimum and maximum refinement levels    
	}

    flap_lower_front
    {
  	level (5 5);  // Minimum and maximum refinement levels    
	}


    spoiler_upper_top
    {
	level (5 5);  // Minimum and maximum refinement levels    
	}

    spoiler_upper_front
    {
	level (5 5);  // Minimum and maximum refinement levels    
	}

    spoiler_lower_top
    {
	level (5 5);  // Minimum and maximum refinement levels    
	}

    spoiler_lower_front
    {
	level (5 5);  // Minimum and maximum refinement levels    
	}

    }

    // Region refinement
    refinementRegions
    {
/*
     building
    {
	mode distance;
	levels ((10 2));
    }

    flap
    {
	mode distance;
	levels ((0.005 5) (0.02 4) (0.2 3) (0.5 2));
    }
 
    flap_upper_top
    {
	mode distance;
	levels ((0.005 4) (0.1 3) (0.2 2));
    }

    flap_lower_top
    {
	mode distance;
	levels ((0.005 4) (0.1 3) (0.2 2)); 
    }

    flap_upper_front
    {
	mode distance;
	levels ((0.005 4) (0.1 3) (0.2 2));    
	}

    flap_lower_front
    {
	mode distance;
	levels ((0.005 4) (0.1 3) (0.2 2));    
	}


    spoiler_upper_top
    {
	mode distance;
	levels ((0.3 3) (1.5 2));    
	}

    spoiler_upper_front
    {
	mode distance;
	levels ((0.3 3) (1.5 2));    
	}

    spoiler_lower_top
    {
	mode distance;
	levels ((0.3 3) (1.5 2));   
	}

    spoiler_lower_front
    {
	mode distance;
	levels ((0.3 3) (1.5 2));   
	}

*/
     refinementBoxOuter
       {
            mode inside;
            levels ((1e15 1)); 
       }
	   
       refinementBoxInner
       {
            mode inside;
            levels ((1e15 3)); 
       }

	refinementBoxSpoiler
       {
            mode inside;
            levels ((1e15 5)); 
       }

	refinementBoxFlap
       {
            mode inside;
            levels ((1e15 7)); 
       }

    }

    resolveFeatureAngle 30;  // Angle to detect sharp edges
	planarAngle 30;
	allowFreeStandingZoneFaces true;
	locationInMesh (0 10 .25);
	locationsOutsideMesh ((100 100 100));
}

// Snap controls
snapControls
{
	// Reommendations from meshing of NACA tutorial from Wolf Dynamics
	nSmoothPatch 10;
	tolerance 1.0;
	nSolveIter 100;
	nRelaxIter 10;
	nFeatureSnapIter 100;
 
	// Settings Needed for 2D
	implicitFeatureSnap true; //These were originally flipped: this true
    explicitFeatureSnap false; //this false
    multiRegionFeatureSnap false;
 
}

// Boundary Layers
addLayersControls
{
	relativeSizes true;
 
	// Layer thickness specification. This can be specified in one of following
    // ways:
    // - expansionRatio and finalLayerThickness (cell nearest internal mesh)
    // - expansionRatio and firstLayerThickness (cell on surface)
    // - overall thickness and firstLayerThickness
    // - overall thickness and finalLayerThickness
    // - overall thickness and expansionRatio
 
	// Expansion factor for layer mesh
	// expansionRatio 1.2;
	expansionRatio 1.15;
 
	// Wanted thickness of the layer furthest away from the wall.
    // If relativeSizes this is relative to undistorted size of cell
    // outside layer.
	// finalLayerThickness 0.137;
	finalLayerThickness 0.4;
 
	// Wanted thickness of the layer next to the wall.
    // If relativeSizes this is relative to undistorted size of cell
    // outside layer.
	// firstLayerThickness 8.63e-5;
 
	// Wanted overall thickness of layers.
    // If relativeSizes this is relative to undistorted size of cell
    // outside layer.
    // thickness 0.5
 
	// Minimum overall thickness of total layers. If for any reason layer
    // cannot be above minThickness do not add layer.
    // If relativeSizes this is relative to undistorted size of cell
    // outside layer.
	// minThickness 0.00001;
	minThickness 0.2;
 
	layers
    {
	building
        {
            nSurfaceLayers 10;
        }


        flap
        {
            nSurfaceLayers 20;
        }
	flap_upper_top
    {
        nSurfaceLayers 20;    }

    flap_lower_top
    {
        nSurfaceLayers 20;    }

    flap_upper_front
    {
        nSurfaceLayers 20;    }

    flap_lower_front
    {
        nSurfaceLayers 20;    }


    spoiler_upper_top
    {
        nSurfaceLayers 20;    }

    spoiler_upper_front
    {
        nSurfaceLayers 20;    }

    spoiler_lower_top
    {
        nSurfaceLayers 20;    }

    spoiler_lower_front
    {
        nSurfaceLayers 20;    }

		ground
		{
			nSurfaceLayers 5;
		}
    }
 
	// If points get not extruded do nGrow layers of connected faces that are
    // also not grown. This helps convergence of the layer addition process
    // close to features.
	nGrow 1;
 
	// Static analysis of starting mesh
 
	// When not to extrude surface. 0 is flat surface, 90 is when two faces
	// are perpendicular
	featureAngle 170;
  
	// Stop layer growth on highly warped cells
	maxFaceThicknessRatio 0.5;
 
    // Patch displacement
 
	// Number of smoothing iterations of surface normals
	nSmoothSurfaceNormals 3;
  
	// Smooth layer thickness over surface patches
	nSmoothThickness 10;
  
	// Medial axis analysis
 
	// minMedianAxisAngle 90;
	// minMedianAxisAngle 80;
	minMedianAxisAngle 130; // Adjusted setting from Will Wiley
	minMedialAxisAngle 80;
	
	
	// Reduce layer growth where ratio thickness to medial
	// distance is large
	// maxThicknessToMedialRatio 0.3;
	maxThicknessToMedialRatio 0.6; // Adjusted setting from Will Wiley
	
	// Number of smoothing iterations of interior mesh movement direction
	nSmoothNormals 1;
 
	// Mesh shrinking
 
	slipFeatureAngle 30;
	nRelaxIter 20;
	// nRelaxedIter 10;
	// nLayerIter 50; //IMPORTANT - SET TO 1 TO DISABLE QUALITY CHECKS OF BL
	nLayerIter 80; // Adjusted setting from Will Wiley
	nBufferCellsNoExtrude 0;
  
	// Extra Controls
 
	concaveAngle 30;
	mergePatchFacesAngle 60;
	layerTerminationAngle -180; // Added setting from Will Wiley
}

// Mesh quality settings
meshQualityControls
{
	// Maximum non-orthogonality allowed. Set to 180 to disable.
    maxNonOrtho 75;
 
	// Max skewness allowed. Set to <0 to disable.
    maxBoundarySkewness 4;
    maxInternalSkewness 4;
 
	// Set to 180 to disable.
    maxConcave 80;
 
	//  Set to very negative number (e.g. -1E30) to disable.
	minVol 1e-13;
 
	// Minimum quality of the tet formed by the face-centre
	// and variable base point minimum decomposition triangles and
	// the cell centre. Set to very negative number (e.g. -1E30) to
	// disable.
	//    <0 = inside out tet,
	//     0 = flat tet
	//     1 = regular tet
	// 1e-15 (small positive) to enable tracking
	//-1e+30 (large negative) for best layer insertion
	minTetQuality -1e+30; 
 
	// Minimum face area. Set to <0 to disable.
	minArea -1;
	
	minTwist 0.02;
	
	minDeterminant 0.001;
	
	minFaceWeight 0.05;
	
	minVolRatio 0.01;
	
	minTriangleTwist -1;

    // Number of error distribution iterations
	errorReduction 0.75;
 
	// amount to scale back displacement at error points
	nSmoothScale 4;
}

// Advanced settings
debug 0;
mergeTolerance 1e-6;
