Air Brake - Flap Cases/SteadyCase-BaseCode/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
Building.stl
{
	// Extract raw features (none | extractFromFile | extractFromSurface)
    extractionMethod    extractFromSurface;

    // Mark edges whose adjacent surface normals are at an angle less
    // than includedAngle as features
    // - 0  : selects no edges
    // - 180: selects all edges
    includedAngle       160;

    // Do not mark region edges
    geometricTestOnly   yes;

    // Generate additional intersection features (none | self | region)
    intersectionMethod  none;

    // Tolerance for surface intersections
    // tolerance           1e-3;

	// Output options:

    // Write features to obj format for postprocessing
    writeObj            yes;

}

Flap.stl
{
	// Extract raw features (none | extractFromFile | extractFromSurface)
    extractionMethod    extractFromSurface;

    // Mark edges whose adjacent surface normals are at an angle less
    // than includedAngle as features
    // - 0  : selects no edges
    // - 180: selects all edges
    includedAngle       160;

    // Do not mark region edges
    geometricTestOnly   yes;

    // Generate additional intersection features (none | self | region)
    intersectionMethod  none;

    // Tolerance for surface intersections
    // tolerance           1e-3;

	// Output options:

    // Write features to obj format for postprocessing
    writeObj            yes;

}
Flap-Lower-Front.stl
{
	// Extract raw features (none | extractFromFile | extractFromSurface)
    extractionMethod    extractFromSurface;

    // Mark edges whose adjacent surface normals are at an angle less
    // than includedAngle as features
    // - 0  : selects no edges
    // - 180: selects all edges
    includedAngle       160;

    // Do not mark region edges
    geometricTestOnly   yes;

    // Generate additional intersection features (none | self | region)
    intersectionMethod  none;

    // Tolerance for surface intersections
    // tolerance           1e-3;

	// Output options:

    // Write features to obj format for postprocessing
    writeObj            yes;

}
Flap-Lower-Top.stl
{
	// Extract raw features (none | extractFromFile | extractFromSurface)
    extractionMethod    extractFromSurface;

    // Mark edges whose adjacent surface normals are at an angle less
    // than includedAngle as features
    // - 0  : selects no edges
    // - 180: selects all edges
    includedAngle       160;

    // Do not mark region edges
    geometricTestOnly   yes;

    // Generate additional intersection features (none | self | region)
    intersectionMethod  none;

    // Tolerance for surface intersections
    // tolerance           1e-3;

	// Output options:

    // Write features to obj format for postprocessing
    writeObj            yes;

}
Flap-Upper-Front.stl
{
	// Extract raw features (none | extractFromFile | extractFromSurface)
    extractionMethod    extractFromSurface;

    // Mark edges whose adjacent surface normals are at an angle less
    // than includedAngle as features
    // - 0  : selects no edges
    // - 180: selects all edges
    includedAngle       160;

    // Do not mark region edges
    geometricTestOnly   yes;

    // Generate additional intersection features (none | self | region)
    intersectionMethod  none;

    // Tolerance for surface intersections
    // tolerance           1e-3;

	// Output options:

    // Write features to obj format for postprocessing
    writeObj            yes;

}
Flap-Upper-Top.stl
{
	// Extract raw features (none | extractFromFile | extractFromSurface)
    extractionMethod    extractFromSurface;

    // Mark edges whose adjacent surface normals are at an angle less
    // than includedAngle as features
    // - 0  : selects no edges
    // - 180: selects all edges
    includedAngle       160;

    // Do not mark region edges
    geometricTestOnly   yes;

    // Generate additional intersection features (none | self | region)
    intersectionMethod  none;

    // Tolerance for surface intersections
    // tolerance           1e-3;

	// Output options:

    // Write features to obj format for postprocessing
    writeObj            yes;

}
Spoiler-Lower-Front.stl
{
	// Extract raw features (none | extractFromFile | extractFromSurface)
    extractionMethod    extractFromSurface;

    // Mark edges whose adjacent surface normals are at an angle less
    // than includedAngle as features
    // - 0  : selects no edges
    // - 180: selects all edges
    includedAngle       160;

    // Do not mark region edges
    geometricTestOnly   yes;

    // Generate additional intersection features (none | self | region)
    intersectionMethod  none;

    // Tolerance for surface intersections
    // tolerance           1e-3;

	// Output options:

    // Write features to obj format for postprocessing
    writeObj            yes;

}
Spoiler-Lower-Top.stl
{
	// Extract raw features (none | extractFromFile | extractFromSurface)
    extractionMethod    extractFromSurface;

    // Mark edges whose adjacent surface normals are at an angle less
    // than includedAngle as features
    // - 0  : selects no edges
    // - 180: selects all edges
    includedAngle       160;

    // Do not mark region edges
    geometricTestOnly   yes;

    // Generate additional intersection features (none | self | region)
    intersectionMethod  none;

    // Tolerance for surface intersections
    // tolerance           1e-3;

	// Output options:

    // Write features to obj format for postprocessing
    writeObj            yes;

}
Spoiler-Upper-Front.stl
{
	// Extract raw features (none | extractFromFile | extractFromSurface)
    extractionMethod    extractFromSurface;

    // Mark edges whose adjacent surface normals are at an angle less
    // than includedAngle as features
    // - 0  : selects no edges
    // - 180: selects all edges
    includedAngle       160;

    // Do not mark region edges
    geometricTestOnly   yes;

    // Generate additional intersection features (none | self | region)
    intersectionMethod  none;

    // Tolerance for surface intersections
    // tolerance           1e-3;

	// Output options:

    // Write features to obj format for postprocessing
    writeObj            yes;

}
Spoiler-Upper-Top.stl
{
	// Extract raw features (none | extractFromFile | extractFromSurface)
    extractionMethod    extractFromSurface;

    // Mark edges whose adjacent surface normals are at an angle less
    // than includedAngle as features
    // - 0  : selects no edges
    // - 180: selects all edges
    includedAngle       160;

    // Do not mark region edges
    geometricTestOnly   yes;

    // Generate additional intersection features (none | self | region)
    intersectionMethod  none;

    // Tolerance for surface intersections
    // tolerance           1e-3;

	// Output options:

    // Write features to obj format for postprocessing
    writeObj            yes;

}


// ************************************************************************* //
